app/controllers/feedbacks_controller.rb

  def index
    rating_filter = params[:rating].to_s.split(",").map(&:to_i)

    if !rating_filter.empty?
      feedbacks = Feedback.where(rating: rating_filter).last(15)
    else
      feedbacks = Feedback.last(15)
---
SELECT  "feedbacks".* FROM "feedbacks" WHERE "feedbacks"."rating" = ?  ORDER BY "feedbacks"."id" DESC LIMIT 15  [["rating", 5]]
SELECT  "feedbacks".* FROM "feedbacks"  ORDER BY "feedbacks"."id" DESC LIMIT 15

  def create
    session = Session.find(params[:session_id])
    feedback = Feedback.create!(user: current_user, session: session, rating: params[:rating], comment: params[:comment])
---
INSERT INTO "feedbacks" ("user_id", "session_id", "rating", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["session_id", 1], ["rating", 4], ["comment", "not that bad"], ["created_at", "2017-08-17 16:34:12.250501"], ["updated_at", "2017-08-17 16:34:12.250501"]]